import { TQuestion } from './store/types';

export const questions: TQuestion[] = [
  {
    id: 16,
    name: 'Якими документами визначається обсяг автономії закладів освіти?',
    url: 'https://edirshkoly.mcfr.ua/825658',
    answers: [
      {
        id: 61,
        question_id: 16,
        name: '\nЛише установчими документами закладу.',
        istrue: false,
      },
      {
        id: 62,
        question_id: 16,
        name:
          'Законом про освіту; Законом про повну загальну середню освіту; установчими документами закладу.',
        istrue: true,
      },
      {
        id: 63,
        question_id: 16,
        name: 'Лише Законом про освіту.',
        istrue: false,
      },
      {
        id: 64,
        question_id: 16,
        name: 'Рішенням засновника закладу.',
        istrue: false,
      },
    ],
  },
  {
    id: 17,
    name: 'Які вимоги до опорного закладу освіти?',
    url: 'https://edirshkoly.mcfr.ua/825659',
    answers: [
      {
        id: 65,
        question_id: 17,
        name: 'Умова — єдина: забезпечити заклад кваліфікованими педагогами. \n',
        istrue: false,
      },
      {
        id: 66,
        question_id: 17,
        name:
          'Мати філії та/або здійснювати підвезення здобувачів освіти, педагогічних працівників (за потреби) до цього закладу і у зворотному напрямку.',
        istrue: false,
      },
      {
        id: 67,
        question_id: 17,
        name:
          'Мати філії та/або здійснювати підвезення здобувачів освіти, педагогічних працівників (за потреби) до цього закладу і у зворотному напрямку; бути забезпечений кваліфікованими педагогічними кадрами; мати сучасну матеріально-технічну і навчально-методичну базу; бути спроможним забезпечувати на належному рівні здобуття початкової та базової середньої освіти.',
        istrue: true,
      },
      {
        id: 68,
        question_id: 17,
        name:
          'Мати сучасну матеріально-технічну і навчально-методичну базу та бути спроможним забезпечувати на належному рівні здобуття початкової та базової середньої освіти.',
        istrue: false,
      },
    ],
  },
  {
    id: 18,
    name: 'За якої умови юридична особа має статус закладу освіти?',
    url: 'https://edirshkoly.mcfr.ua/825660',
    answers: [
      {
        id: 69,
        question_id: 18,
        name: 'Якщо засновник ухвалив рішення про це.',
        istrue: false,
      },
      {
        id: 70,
        question_id: 18,
        name: 'Якщо основним видом її діяльності є освітня.',
        istrue: true,
      },
      {
        id: 71,
        question_id: 18,
        name:
          'Якщо основними видами її діяльності є освітня діяльність та діяльність у сфері підвищення кваліфікації.',
        istrue: false,
      },
      {
        id: 72,
        question_id: 18,
        name: 'Якщо МОН видало відповідний наказ.',
        istrue: false,
      },
    ],
  },
  {
    id: 19,
    name: 'У якому статусі може діяти заклад освіти як суб’єкт господарювання?',
    url: 'https://edirshkoly.mcfr.ua/825661',
    answers: [
      {
        id: 73,
        question_id: 19,
        name: 'Як державний чи комунальний.\n',
        istrue: false,
      },
      {
        id: 74,
        question_id: 19,
        name: 'Лише як бюджетна установа.',
        istrue: false,
      },
      {
        id: 75,
        question_id: 19,
        name: 'Бюджетна установа; неприбутковий заклад освіти; прибутковий заклад освіти.',
        istrue: true,
      },
      {
        id: 76,
        question_id: 19,
        name: 'Як неприбутковий, так і прибутковий заклад освіти.',
        istrue: false,
      },
    ],
  },
  {
    id: 20,
    name: 'Які документи закладу освіти належать до установчих?',
    url: 'https://edirshkoly.mcfr.ua/825662',
    answers: [
      {
        id: 77,
        question_id: 20,
        name:
          'Рішення засновника (засновників) про утворення закладу освіти; статут; засновницький договір, укладений між засновниками (в окремих випадках).\n',
        istrue: true,
      },
      {
        id: 78,
        question_id: 20,
        name: 'Лише рішення засновника (засновників) про утворення закладу освіти.',
        istrue: false,
      },
      {
        id: 79,
        question_id: 20,
        name: 'Статут закладу та колективний договір.',
        istrue: false,
      },
      {
        id: 80,
        question_id: 20,
        name:
          'Рішення засновника  про утворення закладу освіти та рішення загальних зборів колективу.',
        istrue: false,
      },
    ],
  },
];
